CUsersHYPERPCDocuments1CDemoConversion1/src/DataProcessors/КопированиеСоставаКонвертаций/КопированиеСоставаКонвертаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КопированиеСоставаКонвертаций</name>
  <attributes>
    <name>КонвертацияИсточник</name>
    <type>
      <types>CatalogRef.Конвертации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонвертацияПолучатель</name>
    <type>
      <types>CatalogRef.Конвертации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбрабатыватьПОД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбрабатыватьПКО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбрабатыватьПКПД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбрабатыватьАлгоритмы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

CUsersHYPERPCDocuments1CDemoConversion1/src/Catalogs/ПравилаОбработкиДанных/ПравилаОбработкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаОбработкиДанных</name>
  <basedOn>Catalog.ПравилаКонвертацииОбъектов</basedOn>
  <attributes>
    <name>АлгоритмВыборкаДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередОбработкой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПриОбработке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.ГруппыПравил</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляПолучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектВыборки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоКонвертацииОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОчисткаДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПравилаКонвертацииОбъектов</name>
    <attributes>
      <name>ПравилоКонвертацииОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

CUsersHYPERPCDocuments1CDemoConversion1/src/Catalogs/СоставыКонвертаций/СоставыКонвертаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоставыКонвертаций</name>
  <owners>Catalog.Конвертации</owners>
  <attributes>
    <name>ЭлементКонвертации</name>
    <type>
      <types>CatalogRef.ПравилаКонвертацииПредопределенныхДанных</types>
      <types>CatalogRef.ПравилаКонвертацииОбъектов</types>
      <types>CatalogRef.Алгоритмы</types>
      <types>CatalogRef.ПравилаОбработкиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

CUsersHYPERPCDocuments1CDemoConversion1/src/DataProcessors/КопированиеСоставаКонвертаций/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Заполняет состав конвертации-получателя на основании конвертации-источника
Процедура ЗаполнитьСоставКонвертации() Экспорт
	#Область ОбработкаПравилОбработкиДанных
	Если ОбрабатыватьПОД Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	Правила.Ссылка КАК ЭлементКонвертации
		|ПОМЕСТИТЬ СоставКонвертации
		|ИЗ Справочник.ПравилаОбработкиДанных КАК Правила
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК СоставКонвертации
		|		ПО СоставКонвертации.Владелец = &КонвертацияИсточник
		|		И СоставКонвертации.ЭлементКонвертации = Правила.Ссылка
		|		И СоставКонвертации.Отключить = ЛОЖЬ
		|ГДЕ
		|	Правила.Отключить = ЛОЖЬ И Правила.ПометкаУдаления = ЛОЖЬ
		|;
		|ВЫБРАТЬ
		|	СоставКДобавлению.ЭлементКонвертации,
		|	&КонвертацияПолучатель КАК Конвертация
		|ИЗ СоставКонвертации КАК СоставКДобавлению
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК СоставТекущий
		|ПО СоставТекущий.ЭлементКонвертации = СоставКДобавлению.ЭлементКонвертации
		|	И СоставТекущий.Владелец = &КонвертацияПолучатель
		|ГДЕ СоставТекущий.Отключить IS NULL";
		Запрос.УстановитьПараметр("КонвертацияИсточник", КонвертацияИсточник);
		Запрос.УстановитьПараметр("КонвертацияПолучатель", КонвертацияПолучатель);
		Запрос.УстановитьПараметр("КонфигурацияПолучатель", КонвертацияПолучатель.Конфигурация);


		Выборка = Запрос.Выполнить().Выбрать();
		ОбработатьВыборкуДанных(Выборка);
	КонецЕсли;
	#КонецОбласти
	#Область ОбработкаПравилКонвертацииОбъектов
	Если ОбрабатыватьПКО Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	Правила.Ссылка КАК ЭлементКонвертации
		|ПОМЕСТИТЬ СоставКонвертации
		|ИЗ Справочник.ПравилаКонвертацииОбъектов КАК Правила
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК СоставКонвертации
		|		ПО СоставКонвертации.Владелец = &КонвертацияИсточник
		|		И СоставКонвертации.ЭлементКонвертации = Правила.Ссылка
		|		И СоставКонвертации.Отключить = ЛОЖЬ
		|ГДЕ
		|	Правила.Отключить = ЛОЖЬ И Правила.ПометкаУдаления = ЛОЖЬ
		|;
		|ВЫБРАТЬ
		|	СоставКДобавлению.ЭлементКонвертации,
		|	&КонвертацияПолучатель КАК Конвертация
		|ИЗ СоставКонвертации КАК СоставКДобавлению
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК СоставТекущий
		|ПО СоставТекущий.ЭлементКонвертации = СоставКДобавлению.ЭлементКонвертации
		|	И СоставТекущий.Владелец = &КонвертацияПолучатель
		|ГДЕ СоставТекущий.Отключить IS NULL";
		Запрос.УстановитьПараметр("КонвертацияИсточник", КонвертацияИсточник);
		Запрос.УстановитьПараметр("КонвертацияПолучатель", КонвертацияПолучатель);
		Запрос.УстановитьПараметр("КонфигурацияПолучатель", КонвертацияПолучатель.Конфигурация);
		Выборка = Запрос.Выполнить().Выбрать();
		ОбработатьВыборкуДанных(Выборка);

	КонецЕсли;
	#КонецОбласти
	#Область ОбработкаПравилКонвертацииПредопределенныхДанных
	Если ОбрабатыватьПКПД Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	Правила.Ссылка КАК ЭлементКонвертации
		|ПОМЕСТИТЬ СоставКонвертации
		|ИЗ Справочник.ПравилаКонвертацииПредопределенныхДанных КАК Правила
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК СоставКонвертации
		|		ПО СоставКонвертации.Владелец = &КонвертацияИсточник
		|		И СоставКонвертации.ЭлементКонвертации = Правила.Ссылка
		|		И СоставКонвертации.Отключить = ЛОЖЬ 
		|ГДЕ 
		|	Правила.ПометкаУдаления = ЛОЖЬ
		|;
		|ВЫБРАТЬ
		|	СоставКДобавлению.ЭлементКонвертации,
		|	&КонвертацияПолучатель КАК Конвертация
		|ИЗ СоставКонвертации КАК СоставКДобавлению
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК СоставТекущий
		|ПО СоставТекущий.ЭлементКонвертации = СоставКДобавлению.ЭлементКонвертации
		|	И СоставТекущий.Владелец = &КонвертацияПолучатель
		|ГДЕ СоставТекущий.Отключить IS NULL";
		Запрос.УстановитьПараметр("КонвертацияИсточник", КонвертацияИсточник);
		Запрос.УстановитьПараметр("КонвертацияПолучатель", КонвертацияПолучатель);
		Запрос.УстановитьПараметр("КонфигурацияПолучатель", КонвертацияПолучатель.Конфигурация);
		Выборка = Запрос.Выполнить().Выбрать();
		ОбработатьВыборкуДанных(Выборка);

	КонецЕсли;
	#КонецОбласти
	#Область ОбработкаАлгоритмов
	Если ОбрабатыватьАлгоритмы Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	Правила.Ссылка КАК ЭлементКонвертации,
		|	&КонвертацияПолучатель КАК Конвертация
		|ИЗ Справочник.Алгоритмы КАК Правила
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК СоставТекущий
		|ПО Правила.Ссылка = СоставТекущий.ЭлементКонвертации
		|	И СоставТекущий.Владелец = &КонвертацияПолучатель
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК СоставКонвертации
		|		ПО СоставКонвертации.Владелец = &КонвертацияИсточник
		|		И СоставКонвертации.ЭлементКонвертации = Правила.Ссылка
		|ГДЕ СоставКонвертации.Отключить = ЛОЖЬ 
		|	И Правила.ПометкаУдаления = ЛОЖЬ
		|	И СоставТекущий.Отключить IS NULL";
		Запрос.УстановитьПараметр("КонвертацияИсточник", КонвертацияИсточник);
		Запрос.УстановитьПараметр("КонвертацияПолучатель", КонвертацияПолучатель);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ОбработатьВыборкуДанных(Выборка);

	КонецЕсли;
	#КонецОбласти
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Процедура ОбработатьВыборкуДанных(Выборка)
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Справочники.СоставыКонвертаций.СоздатьЭлемент();
		СправочникОбъект.Владелец = Выборка.Конвертация;
		СправочникОбъект.ЭлементКонвертации = Выборка.ЭлементКонвертации;
		СправочникОбъект.Записать();
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
#КонецЕсли
